let imgswitch = 0;

function changeImage() {
  let img = document.querySelector("#ImageId");

  if (imgswitch === 0) {
    img.setAttribute("src", 'Crafts/Na1.jpg');
    document.getElementById("LabelId").innerHTML = '&#10094Предишна снимка';
    imgswitch = 1;
  } else {
    img.setAttribute("src", 'Crafts/Na.jpg');
    document.getElementById("LabelId").innerHTML = 'Следваща снимка&#10095';
    imgswitch = 0;
  }
}

//Quote Array

const quotes = [];
quotes[0] = "„Не преследвай това, което блести, а онова, което огрява сърцето ти.“";
quotes[1] = "„Винаги бъди себе си. В края на деня това е всичко, което наистина имаш.“";
quotes[2] = "„Успехът трябва да се измерва не толкова с позицията, която човек е достигнал в живота, колкото с препятствията, които е преодолял, докато се е опитвал да успее.“";
quotes[3] = "„Не колко дълго, а колко добре си живял е основното.“";
quotes[4] = "„Животът не е проблем, който трябва да бъде решен, а реалност, която трябва да се изживее.“";
quotes[5] = "„Живей за всяка секунда без колебание.“";
quotes[6] = "„Животът е поредица от различни уроци, които задължително трябва да се изживеят, за да бъдат разбрани.“";
quotes[7] = "„Не е важно какво имаме в живота, а кой имаме в живота си.“";
quotes[8] = "„Животът не е да намериш себе си. Животът е да създаваш себе си.“";
quotes[9] = "„Ако обичате живота, не губете времето си, защото времето е това, от което се състои животът ви.“";
quotes[10] = "„Ако прекарате целия си живот в очакване буря, никога няма да се насладите на прекрасното слънце.“";
quotes[11] = "„Когато спреш да мечтаеш, преставаш да живееш.“";
quotes[12] = "„Обичай живота който живееш. Живей живота, който обичаш.“";
quotes[13] = "„Най-голямото удоволствие в живота е любовта.“";
quotes[14] = "„Водете се от сърцето, а не от главата.“";
quotes[15] = "„Ако искаш да видиш дъгата, трябва да търпиш дъжда.“";
quotes[16] = "„Науката учи да мислиш, но любовта учи да се усмихваш.“";
quotes[17] = "„Тези, които не вярват в магията, никога няма да я намерят.“";
quotes[18] = "„Когато светът е толкова сложен, простият дар на приятелството е в нашите ръце.“";
quotes[19] = "„Приятелството е силно подценено лекарство.“";
quotes[20] = "„Истинското приятелство, като истинската поезия, е изключително рядко – и ценно като перла.“";
quotes[21] = "„Бъдещето принадлежи на хората, които вярват в мечтите си.“";
quotes[22] = "„Целта на живота ни е да бъдем щастливи.“";
quotes[23] = "„Щастието е пътешествие, а не дестинация.“";
quotes[24] = "„Нито едно лекарство не лекува това, което щастието не може.“";
quotes[25] = "„Щастието е ключът към успеха.“"


function randomQuote() {
  let randomNum = Math.floor(Math.random() * 26);
  document.getElementById("quote").innerHTML = quotes[randomNum]
}